Performance Testing/Outputs (10 users)/output_10s.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 10s, iterations: -
         vus: 10,  max: 10

    init [----------------------------------------------------------] starting
    ✗ Status code is 200
     ↳  99% — ✓ 1801 / ✗ 3
    ✗ Response time is less than 200ms
     ↳  82% — ✓ 351 / ✗ 72
    ✓ Content-Type is present
    ✓ Your test name
    ✓ Successful POST request

    checks.....................: 97.54% ✓ 2865 ✗ 72  
    data_received..............: 7.2 MB 724 kB/s
    data_sent..................: 255 kB 26 kB/s
    http_req_blocked...........: avg=1.11ms   min=0s       med=997.3µs  max=20.94ms  p(90)=1.99ms   p(95)=1.99ms  
    http_req_connecting........: avg=997.93µs min=0s       med=996.8µs  max=20.6ms   p(90)=1.47ms   p(95)=1.99ms  
    http_req_duration..........: avg=47.43ms  min=1.73ms   med=18.94ms  max=468.48ms p(90)=128.68ms p(95)=188.5ms 
    http_req_receiving.........: avg=1.94ms   min=0s       med=997.4µs  max=99.93ms  p(90)=3.02ms   p(95)=6.78ms  
    http_req_sending...........: avg=88.49µs  min=0s       med=0s       max=2.52ms   p(90)=15.78µs  p(95)=997.06µs
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=45.4ms   min=1.73ms   med=17.95ms  max=464.49ms p(90)=121.69ms p(95)=186.46ms
    http_reqs..................: 1909   190.899922/s
    iteration_duration.........: avg=945.85ms min=693.27ms med=980.41ms max=1.1s     p(90)=1.07s    p(95)=1.08s   
    iterations.................: 100    9.999996/s
    vus........................: 10     min=10 max=10
    vus_max....................: 10     min=10 max=10