Performance Testing/Outputs (10 users)/output_20s.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 20s, iterations: -
         vus: 10,  max: 10

    init [----------------------------------------------------------] starting
    ✓ Your test name
    ✓ Successful POST request
    ✓ Status code is 200
    ✗ Response time is less than 200ms
     ↳  94% — ✓ 778 / ✗ 43
    ✓ Content-Type is present

    checks.....................: 99.24% ✓ 5687 ✗ 43  
    data_received..............: 14 MB  722 kB/s
    data_sent..................: 513 kB 26 kB/s
    http_req_blocked...........: avg=1.16ms   min=0s       med=997.5µs  max=25.41ms  p(90)=1.99ms   p(95)=1.99ms  
    http_req_connecting........: avg=1.01ms   min=0s       med=997.1µs  max=25.41ms  p(90)=1.93ms   p(95)=1.99ms  
    http_req_duration..........: avg=49.95ms  min=1.93ms   med=32.91ms  max=447.92ms p(90)=107.97ms p(95)=142.72ms
    http_req_receiving.........: avg=2.42ms   min=0s       med=999.7µs  max=169.63ms p(90)=4.98ms   p(95)=10.59ms 
    http_req_sending...........: avg=113.22µs min=0s       med=0s       max=5.84ms   p(90)=895.41µs p(95)=997.3µs 
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=47.4ms   min=1.93ms   med=30.11ms  max=447.92ms p(90)=103.9ms  p(95)=137.62ms
    http_reqs..................: 3695   184.742096/s
    iteration_duration.........: avg=975.41ms min=638.93ms med=988.75ms max=1.17s    p(90)=1.07s    p(95)=1.11s   
    iterations.................: 201    10.04957/s
    vus........................: 10     min=10 max=10
    vus_max....................: 10     min=10 max=10