Performance Testing/Outputs (10 users)/output_50s.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 50s, iterations: -
         vus: 10,  max: 10

    init [----------------------------------------------------------] starting
    ✓ Successful POST request
    ✗ Status code is 200
     ↳  99% — ✓ 7960 / ✗ 5
    ✗ Response time is less than 200ms
     ↳  93% — ✓ 1750 / ✗ 125
    ✓ Content-Type is present
    ✓ Your test name

    checks.....................: 99.00% ✓ 12972 ✗ 130 
    data_received..............: 33 MB  667 kB/s
    data_sent..................: 1.2 MB 24 kB/s
    http_req_blocked...........: avg=1.31ms   min=0s       med=997.7µs max=27.92ms  p(90)=1.99ms   p(95)=2.03ms  
    http_req_connecting........: avg=1.17ms   min=0s       med=997.2µs max=26.92ms  p(90)=1.99ms   p(95)=1.99ms  
    http_req_duration..........: avg=54.9ms   min=3.44ms   med=34.9ms  max=479.62ms p(90)=119.67ms p(95)=150.97ms
    http_req_receiving.........: avg=2.71ms   min=0s       med=1.07ms  max=76.48ms  p(90)=5.08ms   p(95)=11.35ms 
    http_req_sending...........: avg=113.68µs min=0s       med=0s      max=8ms      p(90)=866.06µs p(95)=997.5µs 
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=52.07ms  min=2.44ms   med=31.91ms max=477.6ms  p(90)=115.64ms p(95)=146.77ms
    http_reqs..................: 8434   168.67522/s
    iteration_duration.........: avg=1.06s    min=639.55ms med=1.06s   max=1.37s    p(90)=1.22s    p(95)=1.25s   
    iterations.................: 463    9.259738/s
    vus........................: 10     min=10  max=10
    vus_max....................: 10     min=10  max=10